{
  "architectures": [
    "SWCBiLSTMModel"
  ],
  "auto_map": {
    "AutoConfig": "bilstm.SWCBiLSTMConfig",
    "AutoModelForSequenceClassification": "bilstm.SWCBiLSTMModel"
  },
  "embedding_dim": 150,
  "embedding_dropout": 0.2,
  "hidden_dim": 384,
  "label_smoothing": 0.2,
  "lr": 0.0001,
  "mlp_dropout": [
    0.5,
    0.2
  ],
  "mlp_ratio": [
    4,
    2
  ],
  "model_type": "swc_bilstm",
  "num_classes": 6,
  "num_layers": 2,
  "recurrent_dropout": 0.2,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "use_extra_mlp": true,
  "vocab_size": 65536,
  "weight_decay": 0.01
}
